.src/vvv/9-windows.org
#+TITLE: Windows


* 快捷键

全局：
- =Win-r= 打开【运行】窗口
- =Win-e= 打开【文件管理器】

记事本中：
- =Ctrl-s= 保存文本内容
- =Ctrl-z= 撤销最近一次修改
- =Ctrl-c/v= 复制、粘贴

* 命令提示符

打开方式:
1. 点击开始菜单 -> 输入 =cmd= 回车 -> 通过 =t:= 切换盘符，通过 =cd= 切换文件夹
2. 快捷键 =Win-r= 后输入 =cmd= 回车 -> 通过 =t:= 切换盘符，通过 =cd= 切换文件夹
3. 在文件管理器的地址栏，输入 =cmd= 直接打开命令提示符，并且当前工作目录就是文件夹位置

基本规则:
- 敲入命令，然后敲回车执行
- 命令类似 =cp a b= 这样的格式，使用空格分割，第一部分 (=cp=) 是命令程序，其他部分是参数。参数可以有 0 个或多个
- 如果敲入命令 (比如 =csc=) 然后按回车，命令提示符将会去寻找相应的可执行文件去执行 (=csc.exe=)。其寻找逻辑如下:
  + 如果当前文件夹下有 =csc.exe=, 那么 csc 代表的就是当前文件夹下的 =csc.exe=
  + 如果当前文件夹下没有 =csc.exe= 文件，那么会在【PATH 环境变量】里配置的文件夹中依次寻找，并使用第一个找到的
  + 如果还是没找到，则显示 =xxx 不是内部或外部命令，也不是可运行的程序或批处理文件=
  + 当然，也可以在命令提示符下，输入完整的可执行文件的路径去显式执行程序

因此，如果在命令提示符下，输入 csc 后显示不是内部命令，则可以:
1. 使用完整路径去调用 csc.exe 程序，比如 =C:\Windows\Microsoft.NET\Framework64\v4.0.30319\csc.exe hello.txt=
2. 配置【PATH 环境变量】，在其中增加 =C:\Windows\Microsoft.NET\Framework64\v4.0.30319= 文件夹

[例子] 通过配置 PATH 环境变量简化 csc 命令的使用:
1. 打开【我的电脑】-【属性】-【高级系统设置】-【环境变量...】
2. 找到【Path】条目，通过添加，将文件夹 =C:\Windows\Microsoft.NET\Framework64\v4.0.30319= 添加到其中
3. 然后打开的任意命令提示符下，你就可以直接调用 =csc= 命令，而不需要输入完整路径了

常用命令:
- =dir=, 用来列出当前工作目录中的内容, dir 是 Directory 的缩写, 即文件夹
- =cd 文件夹路径=, 用来将当前工作目录切换到某个文件夹, cd 是 Change Directory 的缩写, 其中 =cd ..= 表示切换到上一层文件夹
- =del 文件名=, 用来删除文件, del 是 delete 的缩写，即删除
- =ping 8.8.8.8=, 用来测试是否能正常上网
- =ipconfig=, 用来显示当前电脑的 IP 信息

