vvv/9-windows.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-03-11 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Windows</title>
<meta name="author" content="31415929" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='/asset/common.css?33445' />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Windows</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga83a479">1. 快捷键</a></li>
<li><a href="#org7efa8a4">2. 命令提示符</a></li>
</ul>
</div>
</nav>


<section id="outline-container-orga83a479" class="outline-2">
<h2 id="orga83a479"><span class="section-number-2">1.</span> 快捷键</h2>
<div class="outline-text-2" id="text-1">
<p>
全局：
</p>
<ul class="org-ul">
<li><code>Win-r</code> 打开【运行】窗口</li>
<li><code>Win-e</code> 打开【文件管理器】</li>
</ul>

<p>
记事本中：
</p>
<ul class="org-ul">
<li><code>Ctrl-s</code> 保存文本内容</li>
<li><code>Ctrl-z</code> 撤销最近一次修改</li>
<li><code>Ctrl-c/v</code> 复制、粘贴</li>
</ul>
</div>
</section>

<section id="outline-container-org7efa8a4" class="outline-2">
<h2 id="org7efa8a4"><span class="section-number-2">2.</span> 命令提示符</h2>
<div class="outline-text-2" id="text-2">
<p>
打开方式:
</p>
<ol class="org-ol">
<li>点击开始菜单 -&gt; 输入 <code>cmd</code> 回车 -&gt; 通过 <code>t:</code> 切换盘符，通过 <code>cd</code> 切换文件夹</li>
<li>快捷键 <code>Win-r</code> 后输入 <code>cmd</code> 回车 -&gt; 通过 <code>t:</code> 切换盘符，通过 <code>cd</code> 切换文件夹</li>
<li>在文件管理器的地址栏，输入 <code>cmd</code> 直接打开命令提示符，并且当前工作目录就是文件夹位置</li>
</ol>

<p>
基本规则:
</p>
<ul class="org-ul">
<li>敲入命令，然后敲回车执行</li>
<li>命令类似 <code>cp a b</code> 这样的格式，使用空格分割，第一部分 (<code>cp</code>) 是命令程序，其他部分是参数。参数可以有 0 个或多个</li>
<li>如果敲入命令 (比如 <code>csc</code>) 然后按回车，命令提示符将会去寻找相应的可执行文件去执行 (<code>csc.exe</code>)。其寻找逻辑如下:
<ul class="org-ul">
<li>如果当前文件夹下有 <code>csc.exe</code>, 那么 csc 代表的就是当前文件夹下的 <code>csc.exe</code></li>
<li>如果当前文件夹下没有 <code>csc.exe</code> 文件，那么会在【PATH 环境变量】里配置的文件夹中依次寻找，并使用第一个找到的</li>
<li>如果还是没找到，则显示 <code>xxx 不是内部或外部命令，也不是可运行的程序或批处理文件</code></li>
<li>当然，也可以在命令提示符下，输入完整的可执行文件的路径去显式执行程序</li>
</ul></li>
</ul>

<p>
因此，如果在命令提示符下，输入 csc 后显示不是内部命令，则可以:
</p>
<ol class="org-ol">
<li>使用完整路径去调用 csc.exe 程序，比如 <code>C:\Windows\Microsoft.NET\Framework64\v4.0.30319\csc.exe hello.txt</code></li>
<li>配置【PATH 环境变量】，在其中增加 <code>C:\Windows\Microsoft.NET\Framework64\v4.0.30319</code> 文件夹</li>
</ol>

<p>
[例子] 通过配置 PATH 环境变量简化 csc 命令的使用:
</p>
<ol class="org-ol">
<li>打开【我的电脑】-【属性】-【高级系统设置】-【环境变量&#x2026;】</li>
<li>找到【Path】条目，通过添加，将文件夹 <code>C:\Windows\Microsoft.NET\Framework64\v4.0.30319</code> 添加到其中</li>
<li>然后打开的任意命令提示符下，你就可以直接调用 <code>csc</code> 命令，而不需要输入完整路径了</li>
</ol>

<p>
常用命令:
</p>
<ul class="org-ul">
<li><code>dir</code>, 用来列出当前工作目录中的内容, dir 是 Directory 的缩写, 即文件夹</li>
<li><code>cd 文件夹路径</code>, 用来将当前工作目录切换到某个文件夹, cd 是 Change Directory 的缩写, 其中 <code>cd ..</code> 表示切换到上一层文件夹</li>
<li><code>del 文件名</code>, 用来删除文件, del 是 delete 的缩写，即删除</li>
<li><code>ping 8.8.8.8</code>, 用来测试是否能正常上网</li>
<li><code>ipconfig</code>, 用来显示当前电脑的 IP 信息</li>
</ul>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 31415929</p>
<p class="date">Created: 2024-03-11</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>